# Data Modeling

## Registration database

## Modeling a Registration Database

* It is registration time, and the registration process is driven by the online registration system
* Lets think about this and develop a data model for registration
* We'll use Logical Data Structure (LDS) for modeling


1. What are the main entities involved?
1. Ask the question "what do we want to remember about each entity?"
1. How do we uniquely identify each entity?
1. For each attribute, are there other things we want to remember? 

    1. If so, then promote that attribute to an entity
    1. What are the relationships between these entities?

# Data Model: Entities

Here is one version of the model. This one has entities only, without any relationships.

![](registrationdb_entities.png)

# Data Model: Relationships

Here is a version of the model with realtionships. **Notice that there are several many-many relationships**  These relationships need to be further evolved, but we will keep them this way for now.

![](registrationdb_relationships.png)

# Data Model: Converting to a Database

* We will use SQL Data Definition Language (DDL) to create a table

* Full documentation is here:
  * [PostgreSQL 9.4](https://www.postgresql.org/docs/9.4/static/sql-createtable.html)
  * [Latest PostgreSQL](https://www.postgresql.org/docs/current/static/sql-createtable.html)

* More than you want to know at the moment

* Give the table a name
  * Singular noun

* Describe each column (field) with a name and a data type
  * integer
  * real - float
  * text - varchar
  * date 
  
* Describe any constraints
  * One important constraint is to identify the primary key

# SQL: Connecting to Your Database

1. Load sql module in the notebook: `%load_ext sql`

1. Connect to **your** database: `postgresql://yasiro01:@localhost/yasiro01`
  * Replace *yasiro01* with your name both as a user and a database name

In [1]:
import warnings
warnings.filterwarnings('ignore')

%load_ext sql

In [2]:
%%sql 

postgresql://yasiro01:@localhost/yasiro01

'Connected: yasiro01@yasiro01'

# SQL: Data Manipulation

* **C**reate
* **R**ead
* **U**pdate
* **D**elete

# SQL: Database Structure Manipulation

SQL can be used to create both the database structure and data inside.

In [3]:
%%sql

drop table if exists student;

create table student (
    username varchar(8),
    name_first varchar(20),
    name_last varchar(20),
    date_start date,
    
    constraint sid_key primary key(username)
);

Done.
Done.

[]

# SQL: Medatada

Each table hold description of the data (metadata) in its *INFORMATION_SCHEMA.COLUMNS*. Some metadata fields are:

* table_name

* column_name

* is_nullable

* character_maximum_length

* is_updatable

In [4]:
%%sql

select column_name, data_type, character_maximum_length
from INFORMATION_SCHEMA.COLUMNS
where table_name = 'student';

4 rows affected.

[('username', 'character varying', 8),
 ('name_first', 'character varying', 20),
 ('name_last', 'character varying', 20),
 ('date_start', 'date', None)]

# SQL: Create

SQL has another clause, `INSERT`, to add **data** to a database

    insert into table (column_1, column_2, ..., column_n) values(value_1, value_2, ..., value_n);
    
The list of columns is optional. If it is not given then value_1, value_2, etc. must be in the order they appear in the create table statement. If you give the column list then the columns and values must be in the same order.

If you do not give a column its value, it will be null or the default value you specify.

In [5]:
%%sql

insert into student (username, name_first, name_last) values('pottha01', 'Harry', 'Potter');
insert into student (username, name_first, name_last) values('weasro02', 'Ron', 'Weasley');
insert into student values('granhe03', 'Hermione', 'Granger', '2018-02-08');

1 rows affected.
1 rows affected.
1 rows affected.

[]

# SQL: Read

Use `SELECT` clause to read (retrieve) data from the database.

In [6]:
%%sql

select *
from student;

3 rows affected.

[('pottha01', 'Harry', 'Potter', None),
 ('weasro02', 'Ron', 'Weasley', None),
 ('granhe03', 'Hermione', 'Granger', datetime.date(2018, 2, 8))]

# SQL: Conditional Read

In [7]:
%%sql

select *
from student
where date_start is null;

2 rows affected.

[('pottha01', 'Harry', 'Potter', None), ('weasro02', 'Ron', 'Weasley', None)]

# SQL: Update

Use `UPDATE` clause to update (change) data in the database.

In [8]:
%%sql

update student
set date_start = '2018/02/08';

3 rows affected.

[]

In [9]:
%%sql

select *
from student;

3 rows affected.

[('pottha01', 'Harry', 'Potter', datetime.date(2018, 2, 8)),
 ('weasro02', 'Ron', 'Weasley', datetime.date(2018, 2, 8)),
 ('granhe03', 'Hermione', 'Granger', datetime.date(2018, 2, 8))]

# SQL: Conditional Update

Populate the database first

In [10]:
%%sql

insert into student values('aardal01', 'Alice', 'Aardvark', '2018-02-08');
insert into student values('beavbo02', 'Bob', 'Beaver', '2018/02/08');
insert into student values('cheech03', 'Charlie', 'Cheetah', '20180208');
insert into student values('dolpdi04', 'Diana', 'Dolphin', '02/08/2018');
insert into student values('elepev05', 'Eve', 'Elephant', '2/8/18');
insert into student values('flamfr06', 'Fred', 'Flamingo');

1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [11]:
%%sql

select *
from student;

9 rows affected.

[('pottha01', 'Harry', 'Potter', datetime.date(2018, 2, 8)),
 ('weasro02', 'Ron', 'Weasley', datetime.date(2018, 2, 8)),
 ('granhe03', 'Hermione', 'Granger', datetime.date(2018, 2, 8)),
 ('aardal01', 'Alice', 'Aardvark', datetime.date(2018, 2, 8)),
 ('beavbo02', 'Bob', 'Beaver', datetime.date(2018, 2, 8)),
 ('cheech03', 'Charlie', 'Cheetah', datetime.date(2018, 2, 8)),
 ('dolpdi04', 'Diana', 'Dolphin', datetime.date(2018, 2, 8)),
 ('elepev05', 'Eve', 'Elephant', datetime.date(2018, 2, 8)),
 ('flamfr06', 'Fred', 'Flamingo', None)]

In [12]:
%%sql

update student
set date_start = '2017-09-01'
where date_start is null;

1 rows affected.

[]

In [13]:
%%sql

select *
from student;

9 rows affected.

[('pottha01', 'Harry', 'Potter', datetime.date(2018, 2, 8)),
 ('weasro02', 'Ron', 'Weasley', datetime.date(2018, 2, 8)),
 ('granhe03', 'Hermione', 'Granger', datetime.date(2018, 2, 8)),
 ('aardal01', 'Alice', 'Aardvark', datetime.date(2018, 2, 8)),
 ('beavbo02', 'Bob', 'Beaver', datetime.date(2018, 2, 8)),
 ('cheech03', 'Charlie', 'Cheetah', datetime.date(2018, 2, 8)),
 ('dolpdi04', 'Diana', 'Dolphin', datetime.date(2018, 2, 8)),
 ('elepev05', 'Eve', 'Elephant', datetime.date(2018, 2, 8)),
 ('flamfr06', 'Fred', 'Flamingo', datetime.date(2017, 9, 1))]

# SQL: Delete

Use `DELETE` clause to delete (remove) data from the database.

In [14]:
%%sql

delete
from student;

9 rows affected.

[]

In [15]:
%%sql

select *
from student;

0 rows affected.

[]

# SQL: Conditional Delete

In [16]:
%%sql

insert into student values('aardal01', 'Alice', 'Aardvark', '2018-02-08');
insert into student values('beavbo02', 'Bob', 'Beaver', '2018/02/08');
insert into student values('cheech03', 'Charlie', 'Cheetah', '20180208');
insert into student values('dolpdi04', 'Diana', 'Dolphin', '02/08/2018');
insert into student values('elepev05', 'Eve', 'Elephant', '2/8/18');
insert into student values('flamfr06', 'Fred', 'Flamingo');

1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [17]:
%%sql

select *
from student;

6 rows affected.

[('aardal01', 'Alice', 'Aardvark', datetime.date(2018, 2, 8)),
 ('beavbo02', 'Bob', 'Beaver', datetime.date(2018, 2, 8)),
 ('cheech03', 'Charlie', 'Cheetah', datetime.date(2018, 2, 8)),
 ('dolpdi04', 'Diana', 'Dolphin', datetime.date(2018, 2, 8)),
 ('elepev05', 'Eve', 'Elephant', datetime.date(2018, 2, 8)),
 ('flamfr06', 'Fred', 'Flamingo', None)]

In [18]:
%%sql

select *
from student
where name_first like 'Charl%';

1 rows affected.

[('cheech03', 'Charlie', 'Cheetah', datetime.date(2018, 2, 8))]

In [19]:
%%sql

delete
from student
where name_first like 'Charl%';

1 rows affected.

[]

In [20]:
%%sql

select *
from student;

5 rows affected.

[('aardal01', 'Alice', 'Aardvark', datetime.date(2018, 2, 8)),
 ('beavbo02', 'Bob', 'Beaver', datetime.date(2018, 2, 8)),
 ('dolpdi04', 'Diana', 'Dolphin', datetime.date(2018, 2, 8)),
 ('elepev05', 'Eve', 'Elephant', datetime.date(2018, 2, 8)),
 ('flamfr06', 'Fred', 'Flamingo', None)]